app/controllers/movies_controller.rb

  def index
	@all_ratings = Movie.list_rating
	if params[:sort_by].nil? && params[:ratings].nil?  && params[:commit].nil?
		if params[:commit].nil?
			if session[:ratings].nil?
				session[:ratings] = {}
				@all_ratings.each{|x| session[:ratings][x] = 1}
---
SELECT "movies".* FROM "movies" WHERE (rating = 'G' OR rating = 'PG' OR rating = 'PG-13' OR rating = 'R')